Terraform plan for __ibo__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.platform_token_service_account_iam[0] will be created
  + resource "google_project_iam_member" "platform_token_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/cloudfunctions.developer"
    }

  # google_service_account.platform_token_service_account will be created
  + resource "google_service_account" "platform_token_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Service account for payment application"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.deployment_service_account_cloud_functions_binding will be created
  + resource "google_service_account_iam_binding" "deployment_service_account_cloud_functions_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:app-deployment@ibo-prod.iam.gserviceaccount.com",
        ]
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.platform_token_service_account will be created
  + resource "google_service_account_iam_member" "platform_token_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ibo-prod.svc.id.goog[payment/payment-service]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_service_account.platform_token_service_account will be created
  + resource "kubernetes_service_account" "platform_token_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "payment-service"
          + namespace        = "payment"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-events-subscription"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "payment-events"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-events-subscription"
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "invetory-threshold-push-dl-error"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "invetory-threshold-push-dl-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "invetory-threshold-push-dl-error"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #391](https://github.com/ebomart/commerce-infrastructure/actions/runs/1696124931)